'use client'; // برای AOS نیاز است
import Breadcrumb from "@/components/modules/breadcrumb/Breadcrumb";
import Footer from "@/components/modules/footer/Footer";
import Navbar from "@/components/modules/navbar/Navbar";
import styles from "@/styles/rules.module.css";
import { authUser } from "@/app/lib/authUser";

export const metadata = {
  title: "قوانین | قهوه ست",
  description: "قوانین و مقررات فروشگاه قهوه ست برای خرید، حریم خصوصی و استفاده از خدمات.",
};

const page = async () => {
  const user = await authUser();

  return (
    <>
      <Navbar isLogin={!!user} />
      <Breadcrumb route={"قوانین"} />
      <div className={styles.container} data-aos="fade-up">
        <h2>قوانین و مقررات قهوه ست</h2>
        <p>
          “قهوه ست” ضمن احترامی که برای حریم شخصی کاربران قائل است، برای خرید،
          ثبت نظر یا استفاده از برخی امکانات وب‌سایت، اطلاعاتی را از کاربران
          درخواست می‌کند تا بتواند خدماتی امن و مطمئن ارائه دهد. برای پردازش و
          ارسال سفارش، اطلاعاتی مانند آدرس، شماره تلفن و ایمیل مورد نیاز است. از
          آنجا که کلیه فعالیت‌های قهوه ست قانونی و مبتنی بر قوانین تجارت
          الکترونیک است و طی فرایند خرید، فاکتور رسمی و بنا به درخواست مشتریان
          حقوقی گواهی ارزش افزوده صادر می‌شود، وارد کردن اطلاعاتی مانند نام و کد
          ملی برای اشخاص حقیقی یا کد اقتصادی و شناسه ملی برای خریدهای سازمانی
          لازم است.
        </p>
        <p>
          آدرس ایمیل و شماره تلفن‌هایی که مشتری در پروفایل خود ثبت می‌کند، تنها
          آدرس ایمیل و تلفن‌های رسمی و مورد تأیید مشتری است و تمام مکاتبات و
          پاسخ‌های شرکت از طریق آن‌ها انجام می‌شود. مشتریان می‌توانند نام، آدرس
          و تلفن شخص دیگری را برای تحویل گرفتن سفارش وارد کنند و قهوه ست تنها
          برای ارسال همان سفارش از این اطلاعات استفاده خواهد کرد.
        </p>
        <p>
          قهوه ست ممکن است برای ارتباط با مشتریان، بهینه‌سازی محتوای وب‌سایت و
          تحقیقات بازاریابی از برخی اطلاعات استفاده کند و برای اطلاع‌رسانی
          رویدادها، اخبار، خدمات و سرویس‌های ویژه یا پروموشن‌ها، برای اعضای
          وب‌سایت ایمیل یا پیامک ارسال نماید. در صورتی که کاربران تمایل به
          دریافت این‌گونه ایمیل‌ها و پیامک‌ها نداشته باشند، می‌توانند عضویت
          دریافت خبرنامه قهوه ست را در پروفایل خود لغو کنند.
        </p>
        <p>
          قهوه ست ممکن است نقد و نظرهای ارسالی کاربران را در راستای رعایت قوانین
          وب‌سایت ویرایش کند. همچنین اگر نظر یا پیام ارسال‌شده توسط کاربر مشمول
          مصادیق محتوای مجرمانه باشد، قهوه ست می‌تواند از اطلاعات ثبت‌شده برای
          پیگیری قانونی استفاده کند. حفظ و نگهداری رمز عبور بر عهده کاربران است
          و برای جلوگیری از هرگونه سوءاستفاده احتمالی، کاربران نباید آن را برای
          شخص دیگری فاش کنند.
        </p>
        <p>
          قهوه ست هویت شخصی کاربران را محرمانه می‌داند و اطلاعات شخصی آنان را به
          هیچ شخص یا سازمان دیگری منتقل نمی‌کند، مگر اینکه با حکم قانونی مجبور
          باشد در اختیار مراجع ذی‌صلاح قرار دهد. قهوه ست مانند سایر وب‌سایت‌ها از
          جمع‌آوری IP و کوکی‌ها استفاده می‌کند، اما پروتکل، سرور و لایه‌های
          امنیتی قهوه ست و روش‌های مناسب مدیریت داده‌ها، اطلاعات کاربران را
          محافظت کرده و از دسترسی‌های غیرقانونی جلوگیری می‌کند.
        </p>
        <p>
          قهوه ست برای حفاظت و نگهداری اطلاعات و حریم شخصی کاربران همه توان خود
          را به کار می‌گیرد و امیدوار است تجربه‌ی خریدی امن، راحت و خوشایند را
          برای همه کاربران فراهم آورد.
        </p>
        <h2>اطلاعات تماس</h2>
        <p>
          آدرس: استان تهران – شهر تهران – خیابان انقلاب، روبروی خیابان ویلا
          (نجات‌اللهی)، فروشگاه قهوه ست
        </p>
        <p>
          تلفن تماس و فکس: <strong>021-66726563</strong>{" "}
          <span>(پاسخگویی طی ساعات کاری)</span>
        </p>
        <p>
          در صورتی که تمایلی به دریافت ایمیل‌ها و خبرنامه‌های قهوه ست ندارید،
          می‌توانید بر روی کلمه لغو عضویت در انتهای ایمیل کلیک کنید.
        </p>
        <p>
          در صورت وجود هرگونه سؤال، لطفاً با اطلاعات تماس فوق ارتباط برقرار
          کنید.
        </p>
      </div>
      <Footer />
    </>
  );
};

export default page;